#### LightDimmingColor Enumeration

---

|  |
| --- |
| See Also |

Tags for specific light dimming colors

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum LightDimmingColor ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration LightDimmingColor ``` |

| Visual C++ |
| --- |
| ``` public enum class LightDimmingColor ``` |

# Members

| Member name | Description |
| --- | --- |
| None | No dimming color. |
| Incandescent | Incandescent lamp curve dimming color. |

# See Also

Autodesk.Revit.DB.Lighting Namespace